package com.example.trading_platform001.user_pages;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.os.Bundle;
import android.widget.TextView;

import com.example.trading_platform001.R;

import butterknife.BindView;
import butterknife.ButterKnife;

public class information_store extends AppCompatActivity {

    @BindView(R.id.toolbarInformation)
    Toolbar toolbar;
    @BindView(R.id.textViewInformation)
    TextView textView;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_information_store);
        ButterKnife.bind(this);

        toolbar.setTitle("Інформація");
        toolbar.setNavigationIcon(R.drawable.ic_baseline_arrow_back_24);
        toolbar.setNavigationOnClickListener(v->finish());

        textView.setText("Наша мета − бути корисними\n" +
                "\n" +
                "Ми віримо, що речі існують для того, щоб робити життя простішим, приємнішим і добрішим. Тому й пошук тієї самої речі повинен бути швидким, зручним і приємним. Ми не просто продаємо побутову техніку, електроніку, прикраси або вино. Ми допомагаємо знайти саме те, що треба, в одному місці та без зайвих хвилювань, щоб ви не витрачали життя на пошуки, а просто жили щасливо. Rozetka − це універсальна відповідь на будь-який запит, початок пошуку та його кінцева зупинка, справжній помічник. Ми назавжди позбавляємо своїх покупців від неприємних компромісів, виконуємо бажання і даємо змогу мріяти сміливіше. Завдяки розумному пошуку та чесному сервісу ми робимо життя наших клієнтів трішки кращим просто зараз.\n" +
                "\n" +
                "Щастя починається з простих речей\n" +
                "\n" +
                "І ми допомагаємо ці речі знайти: закоханим підказуємо, чим здивувати один одного; спортивних мотивуємо ніколи не здаватись і швидше прогресувати; хазяйновитим даємо можливість створити справжній затишок. Ми хочемо, щоб ви знали, що шукаєте, і могли аргументувати свій вибір. Для цього ми знімаємо відеоогляди, пишемо статті та відстежуємо новинки.\n" +
                "\n" +
                "Щоб мрії здійснювалися легко\n" +
                "\n" +
                "Ми відкриваємо величезні офлайн-магазини, щоб ви могли прийти, потримати в руках і протестувати вподобаний продукт. Ми хочемо, щоб у нас був найкращий у світі сервіс, тому навчаємо співробітників не тільки технічній частині справи, а й роботі з клієнтом. А якщо вам, навпаки, хочеться якомога менше спілкуватися з людьми − для цього у нас є поштомати: зробили замовлення, вибрали поштомат, забрали дорогою додому чи на роботу. Все.\n" +
                "\n" +
                "Зручна доставка\n" +
                "\n" +
                "І звичайно, будь-який товар можна замовити з доставкою. Ми доставляємо замовлення по Києву протягом одного дня, а по Україні − на наступний день. Усе − без передоплати, якщо потрібно − у кредит. Оплата готівкова або безготівкова − як вам зручніше.\n" +
                "\n" +
                "Умови доставки та оплати\n" +
                "\n" +
                "Далі − більше\n" +
                "\n" +
                "Ми хочемо, щоб у наших клієнтів взагалі ніколи не виникало запитання «де знайти щось потрібне». Тому сьогодні ми не тільки найбільший онлайн-ритейлер, а ще й майданчик для продавців. Хтось почне з нами свій перший бізнес (або розширить наявний), а хтось − привезе в Україну продукти, яких поки що немає. Це вигідно всім: і покупцям, і продавцям, і навіть нам − адже так ми допоможемо більшій кількості людей стати трохи щасливішими.");
    }
}